# WallNotCoveredByRoof Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallJoinRoofFailures..::..WallNotCoveredByRoof Property
BuiltInFailures..::..WallJoinRoofFailures Class See Also
---
The highlighted wall(s) cannot be joined to the highlighted roof because the roof does not entirely cover the wall(s).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WallNotCoveredByRoof { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallNotCoveredByRoof As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WallNotCoveredByRoof {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallJoinRoofFailures Class
Autodesk.Revit.DB Namespace